In [43]:
import pandas as pd
import numpy as np
from pandas import DataFrame

In [44]:
df = pd.read_csv('2012_SAT_Results.csv',sep=',')
df.head()

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384

## Data Cleaning

In [45]:
# Make column names shorter.
df.columns = ['DBN', 'school_name', 'num_takers', 'reading_avg', 'math_avg', 'writing_avg']

In [46]:
# See if there are any missing value in this dataframe
df.describe()

,DBN,school_name,num_takers,reading_avg,math_avg,writing_avg
count,478,478,478,478,478,478
unique,478,478,175,164,173,163
top,18K637,URBAN ASSEMBLY SCHOOL FOR CAREERS IN SPORTS,s,s,s,s
freq,1,1,57,57,57,57

In [47]:
# Remove rows with non-numeric value 's'
df = df[((df['num_takers'] != 's') & (df['reading_avg'] != 's') & (df['math_avg'] != 's')) & (df['writing_avg'] != 's')]

In [48]:
df.describe()

,DBN,school_name,num_takers,reading_avg,math_avg,writing_avg
count,421,421,421,421,421,421
unique,421,421,174,163,172,162
top,18K637,URBAN ASSEMBLY SCHOOL FOR CAREERS IN SPORTS,54,367,385,368
freq,1,1,10,8,9,9

## Hypothesis

My hypothesis is: Average reading score is correlated with average writing score for schools.

In [49]:
np.array_equal(df.reading_avg, df.reading_avg.astype(str))

True

In [50]:
df[['reading_avg','writing_avg']] = df[['reading_avg','writing_avg']].apply(pd.to_numeric)

In [51]:
df['reading_avg'].corr(df['writing_avg'])

0.9703420246380873

#### Pearson's r is close to 1, which means that there is a stong positive correlation between average reading score and average writing score for schools.